// Написать программу премножения любых целых чисел

Console.Write("Введите первое число: ");
SByte firstNumber = Convert.ToSByte(Console.ReadLine());
Console.Write("Введите второе число: ");
sbyte secondNumber = Convert.ToSByte(Console.ReadLine());
sbyte sum = secondNumber + firstNumber;
Console.WriteLine($"Сумма чисел равна: {sum}");
sum.ToString.